/* The full name of the supporter */
"Registered to {0}" = "Registered to {0}";

/* Cyberduck is open source software */
"Thanks for your support! Your contribution helps to further advance development to make Cyberduck even better." = "Thanks for your support! Your contribution helps to further advance development to make Cyberduck even better.";

/* Copy of donation key */
"Your donation key has been copied to the Application Support folder." = "Your donation key has been copied to the Application Support folder.";

/* Validation failed */
"Not a valid donation key" = "Not a valid donation key";

"This donation key does not appear to be valid." = "This donation key does not appear to be valid.";

/* Thank you */
"Continue" = "Continue";
/* Validation failed */
"Not a valid donation key" = "Not a valid donation key";

"This donation key does not appear to be valid." = "This donation key does not appear to be valid.";

/* Thank you */
"Continue" = "Continue";